{
    "_id": 0,
    "themeName": "Тема 2: Системы счисления",
    "testId": 1,
    "theory" : "Система счисления (СС) - это система записи чисел с помощью определенного набора цифр. CС называется пеозиционной, если одна и та же цифра имеет различное значени, которое определяется ее местом в числе. Десятичная СС является позиционной: 999. Римская СС является непозиционной. Значение цифры Х в числе ХХІ остается неизменным при вариации ее положения в числе. Количество различных цифр, употребляемых в позиционной СС, называется основанием СС. Если основание используемой СС больше десяти, то для цифр вводят условное обозначение со скобкой вверху или буквенное обозначение.\n\nВ шестнадцатеричной СС основа - это цифры 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15 с соответствующими обозначениями 0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F. Примеры чисел: 17D.E, F12A.\n\nДвоичная СС - это система, в которой для записи чисел используются две цифры 0 и 1. Основанием двоичной системы счисления является число 2.Двоичный код числа - запись этого числа в двоичной системе счисления. Например,\n\n1=12\n\n2=102\n\n7=1112\n\n120=11110002.\n\nВ ВТ применяют позиционные СС с недесятичным основанием: двоичную, восьмеричную, шестнадцатеричную. 16-ричная и 8-ричная СС используются при составлении программ на языке машинных кодов для более короткой и удобной записи двоичных кодов – команд, данных, адресов и операндов.\n\nПеревод чисел из десятичной СС в заданную.\n\n1) Для перевода целых чисел десятичной системы счисления в другую систему счисления последовательно выполняют деление нацело на основание новой СС, пока не получат частное, меньшее этого основания.. Число в новой СС записывают, начиная с последнего частного, добавляя к нему остатки. 2) Для перевода десятичных дробей из десятичной СС в другую СС последовательно выполняют умножение дробной части на основание новой системы счисления, пока она не станет равной нулю. Число в новой СС записывают из целых частей произведений, начиная с первого.Для того, чтобы из восьмеричной системы счисления перевести число в двоичный код, необходимо каждую цифру этого числа представить триадой двоичных символов. Лишние нули в старших разрядах отбрасываются.\n\nНапример: 234.778 =010 011 100.111 1112 = 10 011 100.111 1112\n\n1234568 = 001 010 011 100 101 110 2 = 1 010 011 100 101 1102\n\nОбратный перевод: двоичное число делят справа налево (целую часть) и слева на право (дробную часть) на триады двоичных цифр. Каждая триада двоичных цифр заменяется восьмеричной цифрой, при этом, если необходимо, число выравнивается путем дописывания нулей перед целой частью или после дробной.\n\nНапример: 11001112 = 001 100 1112 = 1478\n\n11.10012 = 011.100 1002 = 3.448\n\nПри переводах между двоичной и шестнадцатеричной СС используются четверки цифр. При необходимости выравнивание выполняется до длины двоичного числа, кратной четырем.\n\nНапример: 1234.AB7716 = 0001 0010 0011 0100.1010 1011 0111 01112 =1 0010 0011 0100.1010 1011 0111 01112<\n\nCE56716 = 1100 1110 0101 0110 01112\n\n11001112 = 0110 01112 = 6716\n\nПри переходе из восьмеричного счисления в шестнадцатеричное счисление и обратно используется вспомогательный двоичный код числа.\n\nНапример: 12345678 = 001 010 011 "
}